#+setupfile: ../../research.org

#+title: Common Objects Image Recognition
#+author: Lewis Collum
#+date: Updated: \today
*Started 1/28/2020*

* Model Creation from VGG16
  =model.py=
  #+begin_src python :tangle source/model.py
import keras
from keras.models import Model, load_model
from keras.layers import Activation, Dropout, Flatten, Dense
from keras.preprocessing.image import ImageDataGenerator
from keras.applications.vgg16 import VGG16

import common

baseModel = VGG16(
    weights = 'imagenet',
    include_top = False,
    input_shape = (common.imageSize, common.imageSize, 3))

for layer in baseModel.layers: 
    layer.trainable = False
 
model = keras.models.Sequential()
model.add(baseModel)

model.add(Flatten())
model.add(Dense(1024, activation='relu'))
model.add(Dense(1024, activation='relu'))
model.add(Dense(common.classCount, activation='softmax'))

if __name__ == '__main__':
    print(model.summary())
  #+end_src

  #+RESULTS:
  #+begin_example
     Model: "sequential_1"
     _________________________________________________________________
     Layer (type)                 Output Shape              Param #   
     =================================================================
     vgg16 (Model)                (None, 7, 7, 512)         14714688  
     _________________________________________________________________
     flatten_1 (Flatten)          (None, 25088)             0         
     _________________________________________________________________
     dense_1 (Dense)              (None, 1024)              25691136  
     _________________________________________________________________
     dense_2 (Dense)              (None, 1024)              1049600   
     _________________________________________________________________
     dense_3 (Dense)              (None, 8)                 8200      
     =================================================================
     Total params: 41,463,624
     Trainable params: 26,748,936
     Non-trainable params: 14,714,688
     _________________________________________________________________
     None
  #+end_example

